![University of Tehran](./img/UT.png)
#   <font color='red'><center>AI CA 0<center></font> 
## <center>Dr. Yaghoubzade<center>
### <center>Daniyal Maroufi<center>
### <center>810098039<center>

# Aim

In this assignment, we are going to visualize a dataset of a bank. Then, using a simple classification model, predict if the customer opens a long-term account or not.

## Part 1

In [16]:
import pandas as pd
import numpy as np
df = pd.read_csv("bank_term_deposit.csv")
df

,age,job,marital,education,balance,housing,loan,duration,campaign,pdays,poutcome,y
0,30.0,unemployed,married,primary,1787.0,no,no,79.0,1,-1,unknown,no
1,33.0,services,married,secondary,4789.0,yes,yes,NaN,1,339,failure,no
2,NaN,management,single,tertiary,135.0,yes,no,185.0,1,330,failure,no
3,30.0,management,married,tertiary,1476.0,yes,yes,199.0,4,-1,unknown,no
4,59.0,blue-collar,married,secondary,NaN,yes,no,226.0,1,-1,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33.0,services,married,secondary,-333.0,yes,no,329.0,5,-1,unknown,no
4517,57.0,self-employed,married,tertiary,-3313.0,yes,yes,153.0,1,-1,unknown,no
4518,57.0,technician,married,secondary,295.0,no,no,151.0,11,-1,unknown,no
4519,28.0,blue-collar,married,secondary,1137.0,no,no,129.0,4,211,other,no
4520,44.0,entrepreneur,single,tertiary,1136.0,yes,yes,345.0,2,249,other,no

The columns description:

- Age: number
- The job of the customer: categorial
- The marital status of the customer: categorial (divorced: 0, single: 1, married: 2)
- Education of customer: categorial (primary: 0, secondary: 1, tertiary: 2, unknown: 3)
- Customer's balance in the bank: number
- Their housing loan status: binary (no: 0, yes: 1)
- Their personal loan status: binary (no: 0, yes: 1)
- The time passed since the last call of the customer with the bank: number
- The number of calls with costumer in the campaign: number
- Number of days of the last call with the customer since the previous campaign: number
- The outcome of the previous campaign for the customer: categorial (unknown: 0, failure: 1, success: 2, other: 3)
- If the customer submitted the long-term account or not (Target value)

In [3]:
df.describe()

               age       balance     duration     campaign        pdays
count  3984.000000   4164.000000  4388.000000  4521.000000  4521.000000
mean     41.617470   1136.750240   264.724020     2.793630    39.766645
std      10.696378   2726.204918   261.057119     3.109807   100.121124
min      19.000000  -3313.000000     4.000000     1.000000    -1.000000
25%      32.000000     58.000000   104.000000     1.000000    -1.000000
50%      40.000000    316.000000   185.500000     2.000000    -1.000000
75%      49.000000    997.000000   331.000000     3.000000    -1.000000
max      87.000000  71188.000000  3025.000000    50.000000   871.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        3984 non-null   float64
 1   job        4521 non-null   object
 2   marital    4401 non-null   object
 3   education  4521 non-null   object
 4   balance    4164 non-null   float64
 5   housing    4302 non-null   object
 6   loan       4521 non-null   object
 7   duration   4388 non-null   float64
 8   campaign   4521 non-null   int64
 9   pdays      4521 non-null   int64
 10  poutcome   4521 non-null   object
 11  y          4087 non-null   object
dtypes: float64(3), int64(2), object(7)
memory usage: 424.0+ KB